OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1786.h
#define P1REBM0                 PSMC1BLNKbits.P1REBM0           // bit 0
#define P1REBM1                 PSMC1BLNKbits.P1REBM1           // bit 1
#define P1FEBM0                 PSMC1BLNKbits.P1FEBM0           // bit 4
#define P1FEBM1                 PSMC1BLNKbits.P1FEBM1           // bit 5

#define P1CSRC0                 PSMC1CLKbits.P1CSRC0            // bit 0
#define P1CSRC1                 PSMC1CLKbits.P1CSRC1            // bit 1
#define P1CPRE0                 PSMC1CLKbits.P1CPRE0            // bit 4
#define P1CPRE1                 PSMC1CLKbits.P1CPRE1            // bit 5

#define P1MODE0                 PSMC1CONbits.P1MODE0            // bit 0
#define P1MODE1                 PSMC1CONbits.P1MODE1            // bit 1
#define P1MODE2                 PSMC1CONbits.P1MODE2            // bit 2
#define P1MODE3                 PSMC1CONbits.P1MODE3            // bit 3
#define P1DBRE                  PSMC1CONbits.P1DBRE             // bit 4
#define P1DBFE                  PSMC1CONbits.P1DBFE             // bit 5
#define PSMC1LD                 PSMC1CONbits.PSMC1LD            // bit 6
#define PSMC1EN                 PSMC1CONbits.PSMC1EN            // bit 7

#define PSMC1DBF0               PSMC1DBFbits.PSMC1DBF0          // bit 0
#define PSMC1DBF1               PSMC1DBFbits.PSMC1DBF1          // bit 1
#define PSMC1DBF2               PSMC1DBFbits.PSMC1DBF2          // bit 2
#define PSMC1DBF3               PSMC1DBFbits.PSMC1DBF3          // bit 3
#define PSMC1DBF4               PSMC1DBFbits.PSMC1DBF4          // bit 4
#define PSMC1DBF5               PSMC1DBFbits.PSMC1DBF5          // bit 5
#define PSMC1DBF6               PSMC1DBFbits.PSMC1DBF6          // bit 6
#define PSMC1DBF7               PSMC1DBFbits.PSMC1DBF7          // bit 7

#define PSMC1DBR0               PSMC1DBRbits.PSMC1DBR0          // bit 0
#define PSMC1DBR1               PSMC1DBRbits.PSMC1DBR1          // bit 1
#define PSMC1DBR2               PSMC1DBRbits.PSMC1DBR2          // bit 2
#define PSMC1DBR3               PSMC1DBRbits.PSMC1DBR3          // bit 3
#define PSMC1DBR4               PSMC1DBRbits.PSMC1DBR4          // bit 4
#define PSMC1DBR5               PSMC1DBRbits.PSMC1DBR5          // bit 5
#define PSMC1DBR6               PSMC1DBRbits.PSMC1DBR6          // bit 6
#define PSMC1DBR7               PSMC1DBRbits.PSMC1DBR7          // bit 7

#define PSMC1DC8                PSMC1DCHbits.PSMC1DC8           // bit 0
#define PSMC1DC9                PSMC1DCHbits.PSMC1DC9           // bit 1
#define PSMC1DC10               PSMC1DCHbits.PSMC1DC10          // bit 2
#define PSMC1DC11               PSMC1DCHbits.PSMC1DC11          // bit 3
#define PSMC1DC12               PSMC1DCHbits.PSMC1DC12          // bit 4
#define PSMC1DC13               PSMC1DCHbits.PSMC1DC13          // bit 5
#define PSMC1DC14               PSMC1DCHbits.PSMC1DC14          // bit 6
#define PSMC1DC15               PSMC1DCHbits.PSMC1DC15          // bit 7

#define PSMC1DC0                PSMC1DCLbits.PSMC1DC0           // bit 0
#define PSMC1DC1                PSMC1DCLbits.PSMC1DC1           // bit 1
#define PSMC1DC2                PSMC1DCLbits.PSMC1DC2           // bit 2
#define PSMC1DC3                PSMC1DCLbits.PSMC1DC3           // bit 3
#define PSMC1DC4                PSMC1DCLbits.PSMC1DC4           // bit 4
#define PSMC1DC5                PSMC1DCLbits.PSMC1DC5           // bit 5
#define PSMC1DC6                PSMC1DCLbits.PSMC1DC6           // bit 6
#define PSMC1DC7                PSMC1DCLbits.PSMC1DC7           // bit 7

#define P1DCST                  PSMC1DCSbits.P1DCST             // bit 0
#define P1DCSC1                 PSMC1DCSbits.P1DCSC1            // bit 1
#define P1DCSC2                 PSMC1DCSbits.P1DCSC2            // bit 2
#define P1DCSC3                 PSMC1DCSbits.P1DCSC3            // bit 3
#define P1DCSC4                 PSMC1DCSbits.P1DCSC4            // bit 4
#define P1DCSIN                 PSMC1DCSbits.P1DCSIN            // bit 7

#define P1FEBSC1                PSMC1FEBSbits.P1FEBSC1          // bit 1
#define P1FEBSC2                PSMC1FEBSbits.P1FEBSC2          // bit 2
#define P1FEBSC3                PSMC1FEBSbits.P1FEBSC3          // bit 3
#define P1FEBSC4                PSMC1FEBSbits.P1FEBSC4          // bit 4
#define P1FEBSIN                PSMC1FEBSbits.P1FEBSIN          // bit 7

#define PSMC1FFA0               PSMC1FFAbits.PSMC1FFA0          // bit 0
#define PSMC1FFA1               PSMC1FFAbits.PSMC1FFA1          // bit 1
#define PSMC1FFA2               PSMC1FFAbits.PSMC1FFA2          // bit 2
#define PSMC1FFA3               PSMC1FFAbits.PSMC1FFA3          // bit 3

#define P1TPRIF                 PSMC1INTbits.P1TPRIF            // bit 0
#define P1TDCIF                 PSMC1INTbits.P1TDCIF            // bit 1
#define P1TPHIF                 PSMC1INTbits.P1TPHIF            // bit 2
#define P1TOVIF                 PSMC1INTbits.P1TOVIF            // bit 3
#define P1TPRIE                 PSMC1INTbits.P1TPRIE            // bit 4
#define P1TDCIE                 PSMC1INTbits.P1TDCIE            // bit 5
#define P1TPHIE                 PSMC1INTbits.P1TPHIE            // bit 6
#define P1TOVIE                 PSMC1INTbits.P1TOVIE            // bit 7

#define P1MSRC0                 PSMC1MDLbits.P1MSRC0            // bit 0
#define P1MSRC1                 PSMC1MDLbits.P1MSRC1            // bit 1
#define P1MSRC2                 PSMC1MDLbits.P1MSRC2            // bit 2
#define P1MSRC3                 PSMC1MDLbits.P1MSRC3            // bit 3
#define P1MDLBIT                PSMC1MDLbits.P1MDLBIT           // bit 5
#define P1MDLPOL                PSMC1MDLbits.P1MDLPOL           // bit 6
#define P1MDLEN                 PSMC1MDLbits.P1MDLEN            // bit 7

#define P1OEA                   PSMC1OENbits.P1OEA              // bit 0
#define P1OEB                   PSMC1OENbits.P1OEB              // bit 1
#define P1OEC                   PSMC1OENbits.P1OEC              // bit 2
#define P1OED                   PSMC1OENbits.P1OED              // bit 3
#define P1OEE                   PSMC1OENbits.P1OEE              // bit 4
#define P1OEF                   PSMC1OENbits.P1OEF              // bit 5

#define PSMC1PH8                PSMC1PHHbits.PSMC1PH8           // bit 0
#define PSMC1PH9                PSMC1PHHbits.PSMC1PH9           // bit 1
#define PSMC1PH10               PSMC1PHHbits.PSMC1PH10          // bit 2
#define PSMC1PH11               PSMC1PHHbits.PSMC1PH11          // bit 3
#define PSMC1PH12               PSMC1PHHbits.PSMC1PH12          // bit 4
#define PSMC1PH13               PSMC1PHHbits.PSMC1PH13          // bit 5
#define PSMC1PH14               PSMC1PHHbits.PSMC1PH14          // bit 6
#define PSMC1PH15               PSMC1PHHbits.PSMC1PH15          // bit 7

#define PSMC1PH0                PSMC1PHLbits.PSMC1PH0           // bit 0
#define PSMC1PH1                PSMC1PHLbits.PSMC1PH1           // bit 1
#define PSMC1PH2                PSMC1PHLbits.PSMC1PH2           // bit 2
#define PSMC1PH3                PSMC1PHLbits.PSMC1PH3           // bit 3
#define PSMC1PH4                PSMC1PHLbits.PSMC1PH4           // bit 4
#define PSMC1PH5                PSMC1PHLbits.PSMC1PH5           // bit 5
#define PSMC1PH6                PSMC1PHLbits.PSMC1PH6           // bit 6
#define PSMC1PH7                PSMC1PHLbits.PSMC1PH7           // bit 7

#define P1PHST                  PSMC1PHSbits.P1PHST             // bit 0
#define P1PHSC1                 PSMC1PHSbits.P1PHSC1            // bit 1
#define P1PHSC2                 PSMC1PHSbits.P1PHSC2            // bit 2
#define P1PHSC3                 PSMC1PHSbits.P1PHSC3            // bit 3
#define P1PHSC4                 PSMC1PHSbits.P1PHSC4            // bit 4
#define P1PHSIN                 PSMC1PHSbits.P1PHSIN            // bit 7

#define P1POLA                  PSMC1POLbits.P1POLA             // bit 0
#define P1POLB                  PSMC1POLbits.P1POLB             // bit 1
#define P1POLC                  PSMC1POLbits.P1POLC             // bit 2
#define P1POLD                  PSMC1POLbits.P1POLD             // bit 3
#define P1POLE                  PSMC1POLbits.P1POLE             // bit 4
#define P1POLF                  PSMC1POLbits.P1POLF             // bit 5
#define P1INPOL                 PSMC1POLbits.P1INPOL            // bit 6

#define PSMC1PR8                PSMC1PRHbits.PSMC1PR8           // bit 0
#define PSMC1PR9                PSMC1PRHbits.PSMC1PR9           // bit 1
#define PSMC1PR10               PSMC1PRHbits.PSMC1PR10          // bit 2
#define PSMC1PR11               PSMC1PRHbits.PSMC1PR11          // bit 3
#define PSMC1PR12               PSMC1PRHbits.PSMC1PR12          // bit 4
#define PSMC1PR13               PSMC1PRHbits.PSMC1PR13          // bit 5
#define PSMC1PR14               PSMC1PRHbits.PSMC1PR14          // bit 6
#define PSMC1PR15               PSMC1PRHbits.PSMC1PR15          // bit 7

#define PSMC1PR0                PSMC1PRLbits.PSMC1PR0           // bit 0
#define PSMC1PR1                PSMC1PRLbits.PSMC1PR1           // bit 1
#define PSMC1PR2                PSMC1PRLbits.PSMC1PR2           // bit 2
#define PSMC1PR3                PSMC1PRLbits.PSMC1PR3           // bit 3
#define PSMC1PR4                PSMC1PRLbits.PSMC1PR4           // bit 4
#define PSMC1PR5                PSMC1PRLbits.PSMC1PR5           // bit 5
#define PSMC1PR6                PSMC1PRLbits.PSMC1PR6           // bit 6
#define PSMC1PR7                PSMC1PRLbits.PSMC1PR7           // bit 7

